const minus = require('./minus');
// 10 - 3 เท่ากับ 7
test('10 - 3 เท่ากับ 7', ()=> {
  expect(minus(10,3)).toBe(7);
});

// 25 - 2 เท่ากับ 23
test('25 - 2 เท่ากับ 23', ()=> {
    expect(minus(25,2)).toBe(23);
  });

// 23 - 20 เท่ากับ 3
test('23 - 20 เท่ากับ 3', ()=> {
    expect(minus(23,20)).toBe(3);
  });

// 54 - 20 เท่ากับ 34
test('54 - 20 เท่ากับ 34', ()=> {
    expect(minus(54,20)).toBe(34);
  });
  
// 88 - 44 เท่ากับ 44
test('88 - 44 เท่ากับ 44', ()=> {
    expect(minus(88,44)).toBe(44);
  });