const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
 test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 10 + 20 เท่ากับ 30
test('10 + 20 เท่ากับ 30', () => {
  expect(sum(10,20)).toBe(30);
});

// 101 + 21 เท่ากับ 80
test('101 + 21 เท่ากับ 122', () => {
  expect(sum(101,21)).toBe(122);
});

// 55 + 20 เท่ากับ 75
test('55 + 20 เท่ากับ 75', () => {
  expect(sum(55,20)).toBe(75);
});